# Join Statements - Lab

## Introduction

In this lab, you'll practice your knowledge on Join statements.

## Objectives

You will be able to:
- Write queries that make use of various types of Joins
- Join tables using foreign keys

## CRM Schema

In almost all cases, rather then just working with a single table we will typically need data from multiple tables. 
Doing this requires the use of **joins ** using shared columns from the two tables. 

In this lab, we'll use the same Customer Relationship Management (CRM) database we used in our lecture before!
<img src='Database-Schema.png' width=550>

## Connecting to the Database
Import the necessary packages and connect to the database **data.sqlite**.

In [2]:
import sqlite3
import pandas as pd
conn = sqlite3.connect('data.sqlite')
cur = conn.cursor()

## Display the names of all the employees in Boston.

In [3]:
cur.execute('''
SELECT firstName,lastName FROM employees JOIN offices using(officeCode) WHERE city = 'Boston';
       
''')
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df.head()

  firstName   lastName
0     Julie   Firrelli
1     Steve  Patterson


## Do any offices have no employees?

In [4]:
cur.execute('''
SELECT city
        FROM offices o
        LEFT JOIN employees e
        ON o.officecode = e.officecode
        WHERE o.officecode IS NULL;
''').fetchall()

[]

## Write 3 Questions of your own and answer them

In [5]:
# Answers will vary

In [6]:
# Your code here

In [7]:
# Your code here

In [8]:
# Your code here

## Level Up: Display the names of each product each employee has sold.

In [9]:
cur.execute('''SELECT *
            FROM employees e
            join
            customers c
                on e.employeeNumber = c.salesRepEmployeeNumber
            join
            orders 
                using (customerNumber)
            join
            orderdetails
                using (orderNumber)
            join
            products
                using (productCode)
       
''')
df = pd.DataFrame(cur.fetchall()) #Take results and create dataframe
df.columns = [i[0] for i in cur.description]
df.head()# Your code here

,employeeNumber,lastName,firstName,extension,email,officeCode,reportsTo,jobTitle,customerNumber,customerName,...,priceEach,orderLineNumber,productName,productLine,productScale,productVendor,productDescription,quantityInStock,buyPrice,MSRP
0,1165,Jennings,Leslie,x3291,ljennings@classicmodelcars.com,1,1143,Sales Rep,124,Mini Gifts Distributors Ltd.,...,121.64,2,1958 Setra Bus,Trucks and Buses,1:12,Welly Diecast Productions,"Model features 30 windows, skylights & glare r...",1579,77.90,136.67
1,1165,Jennings,Leslie,x3291,ljennings@classicmodelcars.com,1,1143,Sales Rep,124,Mini Gifts Distributors Ltd.,...,101.50,4,1940 Ford Pickup Truck,Trucks and Buses,1:18,Studio M Art Models,"This model features soft rubber tires, working...",2613,58.33,116.67
2,1165,Jennings,Leslie,x3291,ljennings@classicmodelcars.com,1,1143,Sales Rep,124,Mini Gifts Distributors Ltd.,...,43.27,3,1939 Cadillac Limousine,Vintage Cars,1:18,Studio M Art Models,Features completely detailed interior includin...,6645,23.14,50.31
3,1165,Jennings,Leslie,x3291,ljennings@classicmodelcars.com,1,1143,Sales Rep,124,Mini Gifts Distributors Ltd.,...,58.82,1,1996 Peterbilt 379 Stake Bed with Outrigger,Trucks and Buses,1:32,Red Start Diecast,"This model features, opening doors, detailed e...",814,33.61,64.64
4,1165,Jennings,Leslie,x3291,ljennings@classicmodelcars.com,1,1143,Sales Rep,124,Mini Gifts Distributors Ltd.,...,173.17,7,1968 Ford Mustang,Classic Cars,1:12,Autoart Studio Design,"Hood, doors and trunk all open to reveal highl...",68,95.34,194.57

## Level Up: Display the Number of Products each Employee Has sold

In [13]:
cur.execute('''SELECT e.lastname, count(quantityordered)
            FROM employees e
            join
            customers c
                on e.employeeNumber = c.salesRepEmployeeNumber
            join
            orders 
                using (customerNumber)
            join
            orderdetails
                using (orderNumber)
            GROUP BY e.employeeNumber
''')
df = pd.DataFrame(cur.fetchall()) #Take results and create dataframe
df.columns = [i[0] for i in cur.description]
df.head()# Your code here

    lastName  count(quantityordered)
0   Jennings                     331
1   Thompson                     114
2   Firrelli                     124
3  Patterson                     152
4      Tseng                     142

## Summary

Congrats! You now know how to use Join statements, along with leveraging your foreign keys knowledge!